// These Japanese kanji code table must be in EUC-code.
// If they are converted to the other any code, the Roman-Kana conversion 
//   will be executed correctly.
// 以下の表はローマ字かな変換に用いられる表です。日本語文字コードはEUCである
// 必要があります。たとえ、あなたがJISコードを使っていてもEUCのままにしておいて
// ください。他のコードでは、正しく実行されません。
// ローマ字かな変換の規則は、rktabにきじゅつされています。行が子音(a,b,c
// 順です。母音の行は無視して下さい)に、列が母音(a,i,u,e,o,ya,yi,yu,ye,yo; yは
// hでも同じ変換をする予定です)に対応しています。小さな「つ」は同じ子音を続ける
// ことで、「ん」はnを続けることで入力できます。

char *small_tsu = "っ", *n_Japanese = "ん";
char * onetotwo[128] = {
	"", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
	"", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
	"　", "！", "”", "＃", "＄", "％", "＆", "’", "（", "）", "＊", "＋", "，", "−", "．", "／",
	"０", "１", "２", "３", "４", "５", "６", "７", "８", "９", "：", "；", "＜", "＝", "＞", "？",
	"＠", "Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ",
	"Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "［", "￥", "］", "＾", "＿",
	"｀", "ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ",
	"ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ", "｛", "｜", "｝", "￣", ""
};

char *rktab[26][10] = {
	{"あ", "い", "う", "え", "お", "や", "い", "ゆ", "いぇ", "よ"},  // a
	{"ば", "び", "ぶ", "べ", "ぼ", "びゃ", "びぃ", "びゅ", "びぇ", "びょ"},  // b
	{"か", "ち", "く", "つぇ", "こ", "ちゃ", "ちぃ", "ちゅ", "ちぇ", "ちょ"},  // c
	{"だ", "でぃ", "づ", "で", "ど", "でゃ", "でぃ", "でゅ", "でぇ", "でょ"},  // d
	{"", "", "", "", "", "", "", "", "", ""},  // e
	{"ふぁ", "ふぃ", "ふ", "ふぇ", "ふぉ", "ふゃ", "ふぃ", "ふゅ", "ふぇ", "ふょ"},  // f
	{"が", "ぎ", "ぐ", "げ", "ご", "ぎゃ", "ぎぃ", "ぎゅ", "ぎぇ", "ぎょ"},  // g
	{"は", "ひ", "ふ", "へ", "ほ", "ひゃ", "ひぃ", "ひゅ", "ひぇ", "ひょ"},  // h
	{"", "", "", "", "", "", "", "", "", ""},  // i
	{"じゃ", "じ", "じゅ", "じぇ", "じょ", "じゃ", "じぃ", "じゅ", "じぇ", "じょ"},  // j
	{"か", "き", "く", "け", "こ", "きゃ", "きぃ", "きゅ", "きぇ", "きょ"},  // k
	{"ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ぃ", "ゅ", "ぇ", "ょ"},  // l
	{"ま", "み", "む", "め", "も", "みゃ", "みぃ", "みゅ", "みぇ", "みょ"},  // m
	{"な", "に", "ぬ", "ね", "の", "にゃ", "にぃ", "にゅ", "にぇ", "にょ"},  // n
	{"", "", "", "", "", "", "", "", "", ""},  // o
	{"ぱ", "ぴ", "ぷ", "ぺ", "ぽ", "ぴゃ", "ぴぃ", "ぴゅ", "ぴぇ", "ぴょ"},  // p
	{"くぁ", "くぃ", "きゅ", "くぇ", "くぉ", "くゃ", "くぃ", "きゅ", "くぇ", "くょ"},  // q
	{"ら", "り", "る", "れ", "ろ", "りゃ", "りぃ", "りゅ", "りぇ", "りょ"},  // r
	{"さ", "し", "す", "せ", "そ", "しゃ", "し", "しゅ", "しぇ", "しょ"},  // s
	{"た", "ち", "つ", "て", "と", "ちゃ", "ちぃ", "ちゅ", "ちぇ", "ちょ"},  // t
	{"", "", "", "", "", "", "", "", "", ""},  // u
	{"う゛ぁ", "う゛ぃ", "う゛", "う゛ぇ", "う゛ぉ", "う゛ゃ", "う゛ぃ", "う゛ゅ", "う゛ぇ", "う゛ょ"},  // v
	{"わ", "うぃ", "う", "うぇ", "を", "ｗや", "ｗい", "ｗゆ", "ｗいぇ", "ｗよ"},  // w
	{"ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ぃ", "ゅ", "ぇ", "ぉ"},  // x
	{"や", "い", "ゆ", "いぇ", "よ", "や", "い", "ゆ", "いぇ", "よ"},  // y
	{"ざ", "じ", "ず", "ぜ", "ぞ", "じゃ", "じぃ", "じゅ", "じぇ", "じょ"}   // z
};


















